app/controllers/forms_controller.rb

  def index
    @forms = Form.all
---
SELECT "forms".* FROM "forms"

  def show
    @form = Form.find(params[:id])
---
SELECT  "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @form = Form.new(form_params)

    respond_to do |format|
      if @form.save
---
INSERT INTO "forms" ("date", "manufacturer", "model", "hood_size", "location", "e1", "e2", "e3", "e4", "e5", "e6", "e7", "e8", "e9", "e10", "e11", "e12", "e13", "e14", "e15", "exhaust_test_velocities", "exhaust_filter_size", "exhaust_filter_manufacturer", "exhaust_average_velocity", "exhaust_filter_area", "exhaust_filter_factor", "remarks", "duct_size_1", "duct_size_2", "s1", "s2", "s3", "s4", "supply_test_velocities", "supply_filter_size", "supply_filter_manufacturer", "supply_opening_area", "exhaust_design_data", "make_up_design_data", "title", "street_address", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @form.update(form_params)
---
UPDATE "forms" SET "e1" = ?, "e2" = ?, "e4" = ?, "e5" = ?, "e6" = ?, "e7" = ?, "e8" = ?, "e9" = ?, "e10" = ?, "e11" = ?, "updated_at" = ? WHERE "forms"."id" = ?  [["e1", 340], ["e2", 345], ["e4", 344], ["e5", 355], ["e6", 360], ["e7", 362], ["e8", 355], ["e9", 358], ["e10", 345], ["e11", 330], ["updated_at", 2016-12-30 05:20:30 UTC], ["id", 1]]

  def destroy
    @form.destroy
---
DELETE FROM "forms" WHERE "forms"."id" = ?  [["id", 4]]

    def set_form
      @form = Form.find(params[:id])
---
SELECT  "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]